> > > > override_template_disk
> > > 
> > > 
> > > Hi @buec011
> > > `override_template_disk` aim is to use only on VM creation to edit disks which comes within template - this allows change size before first VM boot up. If you want update/change disk when separate resource `vcd_vm_internal_disk` should be used.
> > 
> > 
> > There are rare cases I want to increase the size of the boot disk (template disk) during lifecycle of the VM. At least with Linux, you can resize the root disk online without a reboot.
> > The use of vcd_vm_internal_disk won't work for the template disk. AFAIK I cannot manage the template disk with vcd_vm_internal_disk because it is already managed by override_template_disk. We will get a conflict if we import the template disk as vcd_vm_internal_disk.
> 
> It's ok. `override_template_disk` will work only on VM creation(update will ignore `override_template_disk` changes) (I will update documentation to state explicitly) later internal disks should be managed by `vcd_vm_internal_disk` if it is new of was in template.
> P.s. After VM created vCD don't know which is disk from template or not.

OK, did the following. Is this the way you considered?
1) terraform apply with
```
resource "vcd_vapp_vm" "instance" {
  name          = var.hostname
  computer_name = var.hostname
  vapp_name     = vcd_vapp.vapp.name
  catalog_name  = var.image_catalog
  template_name = var.image_string
  cpus          = var.cpu
  cpu_cores     = var.core
  memory        = var.memory

  override_template_disk {
    bus_type    = "paravirtual"
    size_in_mb  = "40960"
    bus_number  = 0
    unit_number = 0
  }
```
Created code to import boot disk:
```
resource "vcd_vm_internal_disk" "tf-myInternalDisk" {
  vapp_name       = vcd_vapp.vapp.name
  vm_name         = var.hostname
  bus_type        = "paravirtual"
  size_in_mb      = 40960
  bus_number      = 0
  unit_number     = 0
}
```
terraform import vcd_vm_internal_disk.tf-myInternalDisk $VCD_ORG.$VCD_VDC.test1.test1.2000
-> Worked

But it wants to replace the boot disk:
```
  # vcd_vm_internal_disk.tf-myInternalDisk must be replaced
-/+ resource "vcd_vm_internal_disk" "tf-myInternalDisk" {
      + allow_vm_reboot  = false
        bus_number       = 0
        bus_type         = "paravirtual"
      ~ id               = "2000" -> (known after apply)
      ~ iops             = 0 -> (known after apply)
      - org              = "XXX" -> null # forces replacement
        size_in_mb       = 40960
      ~ storage_profile  = "Intermediate" -> (known after apply)
      ~ thin_provisioned = true -> (known after apply)
        unit_number      = 0
        vapp_name        = "test1"
      - vdc              = "XXX" -> null # forces replacement
        vm_name          = "test1"
    }
```
ORG and VDC are set via ENV (VCD_ORG, VCD_VDC) so I omitted it in the HCL.
Did I found a bug that vcd_vm_internal_disk did not work with ENV variables yet?
